SecurityEvent
| where EventID in (4728)
| where TargetAccount ==  "YourDomain\\Domain Admins" or TargetAccount == "YuourDomain\\Enterprise Admins" 
| project EventData 
| parse EventData with * '"SubjectUserName">' SubjectUserName '<' * 
| parse EventData with * '"TargetUserName">' TargetUserName '<' * 
| parse EventData with * '"MemberName">' MemberName '<' * 
| where isnotempty (SubjectUserName) 
| project SubjectUserName, TargetUserName, MemberName
